import { AiOutlineClockCircle } from "react-icons/ai";
import { FaClipboardCheck } from "react-icons/fa";
import { FiCpu, FiEye } from "react-icons/fi";
import { MdSupportAgent, MdVerified } from "react-icons/md";

export const advantagesData = [
  {
    title: "Відкрита співпраця",
    description:
      "Ми працюємо прозоро! Ви завжди можете відвідати ремонтну зону. За вашим бажанням ми надамо старі деталі й продемонструємо встановлені нові, забезпечуючи вашу впевненість у нашій роботі.",
    icon: FiEye,
  },
  {
    title: "Усе під контролем",
    description:
      "Ми завжди узгоджуємо кожен етап роботи. Ви точно знатимете, які деталі замінюються, що саме буде зроблено, скільки часу це займе, і якою буде загальна вартість послуг та запасних частин.",
    icon: FaClipboardCheck,
  },
  {
    title: "Якість із гарантією",
    description:
      "Ми використовуємо лише сертифіковані запчастини від провідних виробників. Після завершення робіт ми надаємо акт виконаних робіт і гарантуємо якість відповідно до чинного законодавства України.",
    icon: MdVerified,
  },
  {
    title: "Сучасний підхід до ремонту",
    description:
      "Завдяки передовим технологіям та сучасному обладнанню ми забезпечуємо точну діагностику автомобіля й виконуємо ремонт з максимальною ефективністю.",
    icon: FiCpu,
  },
  {
    title: "Швидкість і якість",
    description:
      "Планове технічне обслуговування чи навіть складний капітальний ремонт виконується нашими професіоналами швидко та без втрати якості. Ми дбаємо про ваш час і комфорт.",
    icon: AiOutlineClockCircle,
  },
  {
    title: "Постійна підтримка клієнтів",
    description:
      "Ми завжди готові відповісти на ваші запитання та надати професійні консультації. Наша мета — не лише якісно відремонтувати ваш автомобіль, а й забезпечити комфорт і впевненість на кожному етапі співпраці.",
    icon: MdSupportAgent,
  },
];
